Tekla.Structures.DrawingInternal.Operation
Internal operations.

Tekla.Structures.DrawingInternal.Operation.RemoteDocumentManagerController
Gets or sets the remote selected drawings.

Tekla.Structures.DrawingInternal.Operation.FillSelectedDrawings(System.String)
Fill selected drawings.
Param: The parameter.
Returns: The process ID and thread ID string of hex digits.

Tekla.Structures.DrawingInternal.Operation.FillVisibleDrawings(System.String)
Fill visible drawings.
Param: The parameter.
Returns: The process ID and thread ID string of hex digits.

Tekla.Structures.DrawingInternal.Operation.UpdateDocumentManager(System.String)
Update document manager.
param: The drawing ids as newline separated string.
Returns: An empty string.

Tekla.Structures.DrawingInternal.Operation.ShowDocumentManagerWindow(System.String)
Show document manager window.
Param: The parameter.

Tekla.Structures.DrawingInternal.Operation.SetDocumentManagerSelectedDrawing(System.String)
Set document manager selected drawing.
Param: The parameter.
Returns: An empty string.

Tekla.Structures.DrawingInternal.Operation.SetDocumentManagerSelectedDrawings(System.Collections.Generic.IEnumerable{System.Int32})
Set document manager selected drawings.
drawingIds: The drawing IDs.
Returns: An empty string.

Tekla.Structures.DrawingInternal.Operation.SetDrawingPlotDateById(System.Int32)
Set drawing plot date.
drawingId: The drawing ID.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.GetNextModelObjectIdentifier(System.Int32)
Get one of the model object IDs associated to the drawing.
drawingId: The drawing ID.
Returns: The model object ID.

Tekla.Structures.DrawingInternal.Operation.DisplayDrawingPropertiesDialog
DisplayDrawingPropertiesDialog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.ArePoursShownInDrawing
Retrieves value of "Show pours in drawing" property of the currently selected drawing.
Returns: True if the property value is set to "yes", false otherwise

Tekla.Structures.DrawingInternal.Operation.DisplayDrawingUdaDialog
DisplayDrawingUdaDialog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DisplayRevisionDialog
DisplayRevisionDialog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.UpdateSelectedDrawings
UpdateSelectedDrawings.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.NumberDrawings
Numbering drawings.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.UpdateSelectedDrawingMarks
UpdateSelectedDrawingMarks.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.RecreateSelectedDrawings
RecreateSelectedDrawings.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DeleteSelectedDrawings
DeleteSelectedDrawings.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DisplayDrawingCloningDialog
DisplayDrawingCloningDialog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DisplaySnapshotsDialog
DisplaySnapshotsDialog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DisplaySnapshotDialogByFileName(System.String)
DisplaySnapshotsDialogByFileName.
fileName: The fileName to display.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.DisplaySnapshotsDialogByGuid(System.String)
DisplaySnapshotsDialogByGuid.
guid: The drawing GUID.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.AddToMasterDrawingCatalog
AddToMasterDrawingCatalog.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.CopySelectedDrawingsToNewSheet
CopySelectedDrawingsToNewSheet.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.HighlightGridLine(System.Int32)
HighlightGridLine.
GridLineId: The model.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.UnhighlightGridLine(System.Int32)
UnhighlightGridLine.
GridLineId: The model.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.HighlightPartInView(System.Int32,System.Int32)
Highlight part in view.
ModelId: The model object id.
///
ViewId: The view.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.UnhighlightPartInView(System.Int32,System.Int32)
Unhighlight part in view.
ModelId: The model object id.
///
ViewId: The view.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.HighlightCutInView(System.Int32,System.Int32,System.Int32)
Highlight cut in view.
ModelId: The model object id
SectionViewId: Section view id
ContextViewId: Context view id
Returns:

Tekla.Structures.DrawingInternal.Operation.UnhighlightCutInView(System.Int32)
Unhighlight cut in view.
ViewId: The view id
Returns:

Tekla.Structures.DrawingInternal.Operation.ShowAssociativityPinPushed(System.Int32,System.Int32)
Use "pushed" icon for associativity pin.
DrawingObjectId: The drawing object (dimension) Id.
IsStartPoint: True for the dimension start point, false for the dimension end point.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.ShowAssociativityPinUnpushed(System.Int32,System.Int32)
Use normal icon for associativity pin.
DrawingObjectId: The drawing object (dimension) Id.
IsStartPoint: True for the dimension start point, false for the dimension end point.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.FilterDrawingListByParts
ExportFilterDrawingListByParts.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.SignalDrawingSelectionChanged
SignalDrawingSelectionChanged.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.SignalDocumentManagerClosed
SignalDocumentMangerClosed.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.SetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController)
Set document manager controller object on the TS side.
documentManagerController: The document manager controller.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.GetDocumentManagerController(Tekla.Structures.DrawingInternal.IDocumentManagerController@)
Get document manager controller object on the TS side.
documentManagerController: The document manager controller.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.TryOpenDrawing(System.Int32)
Try to open drawing.
drawingId: The drawing ID.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.GetEditMode
GetEditMode.
Returns: The edit mode.

Tekla.Structures.DrawingInternal.Operation.SelectPartsByDrawings
Select parts by drawings.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.GetDrawingsBySelectedParts(System.Boolean,System.Boolean)
Get selected drawing IDs by selected parts.
ignoreFilters: Indicates if the filters set in document manager should be ignored or not.
ignoreGADrawings: Indicates if GA Drawings should be ignored or not.
Returns: The drawing IDs.

Tekla.Structures.DrawingInternal.Operation.SetColorRgb(System.Int32,System.Byte,System.Byte,System.Byte)
Set color rgb.
color: The color.
red: The red component.
green: The green component.
blue: The blue component.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.SetPenWidth(System.Int32,System.Int32)
SetPenWidth
color: The color.
penWidth: The pen width.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.RefreshColorMode
Refresh color mode in drawing editor.
Returns: True if successful.

Tekla.Structures.DrawingInternal.Operation.GetDrawingObject(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Gets drawing object.
id: The identifier.
drawingIdentifier: The drawing identifier.
Returns:
The drawing object.

Tekla.Structures.DrawingInternal.Operation.GetDrawing(Tekla.Structures.Identifier)
Creates an instance of the Drawing class for an existing drawing.
Does not call Select().
drawingId: The drawing identifier.
Returns: The Drawing instance or null in case of failure.

Tekla.Structures.DrawingInternal.Operation.GetCachedDrawing(Tekla.Structures.Identifier)
Gets cached instance of the Drawing class for given drawing id.
Does Select() of cached drawing attributes.
drawingId: The drawing identifier.
Returns: The Drawing instance or null in case of failure.

Tekla.Structures.DrawingInternal.Operation.GetNumberOfNonUpToDateObjectsAndPours
Gets a number of out-of-date objects and pours in the model.
Used for determining whether pour unit recalculation is needed.
Returns: Number of out-of-date objects and pours in the model

Tekla.Structures.DrawingInternal.Operation.AddDimensioningRuleAndModify(Tekla.Structures.Drawing.View,System.String,System.String,System.String)
Add rule to view dimension rules. View is modified in database.
view:
filter:
operation:
property:
Returns:

Tekla.Structures.DrawingInternal.Operation.AddObjectsToViewAndModify(Tekla.Structures.Drawing.View,System.Collections.Generic.List{Tekla.Structures.Identifier})
Add objects to view in GA drawing. View is modified in database.
view:
objects:
Returns:

Tekla.Structures.DrawingInternal.Operation.Select(System.Collections.ArrayList,System.Boolean)
Selects a list of objects from the user interface.
drawingObjects: The list of drawing objects to select.
suppressCallbacks: if set to true, suppress callbacks.
Returns: True on success.

Tekla.Structures.DrawingInternal.Operation.CreateViewWithoutLoadingAttributes(Tekla.Structures.Identifier,Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Creates a drawing view without loading the attributes.
identifier: The identifier.
viewIdentifier: The view identifier.
drawingIdentifier: The drawing identifier.
Returns: The drawing view.

Tekla.Structures.DrawingInternal.Operation.GetDrawingViewVisibilityFilterValue(System.Int32,System.String@)
Gets the drawing view visibility filter value.
drawingViewId: The drawingv view id.
drawingViewVisibilityFilterValue: The drawing view visibility filter value.
Returns: True if the drawing view visibility filter value was succesfully returned.

Tekla.Structures.DrawingInternal.Operation.RaiseReadWindowsNamesByViewIds(System.Int32,System.Int32)
Raises read of the windows names by the given view ids.
modelViewId: The model view id.
drawingViewId: The drawing view id.
Returns: True if reading the windows names was succesfull.

Tekla.Structures.DrawingInternal.Operation.GetAllColorPaletteFilePaths
Get all the color palette file paths based on normal file visibility rule.
Returns: a list of file paths

Tekla.Structures.DrawingInternal.Operation.GetDrawingToObjectMapping(System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.Drawing})
Get drawings to object mapping.
drawings: The list of drawings to inquire about
Returns: List of pair drawing id and model identifier id.

Tekla.Structures.DrawingInternal.Operation.ClientIdToHexString
Client ID to hex string.
Returns: A hex string representation of the client ID.